Revit 2027 API
ViewsExportedByContextEventArgs Methods
The ViewsExportedByContextEventArgs type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetViewIds |  Gets the views that were exported by CustomExporter.
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ViewsExportedByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace